IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_cpu1_periph_ac_regs.xml
<module id="CPU1_PERIPH_AC_REGS" HW_revision="" description="CPU1 PERIPH AC Registers">
	<register id="ADCA_AC" width="32" page="1" offset="0x0" internal="0" description="ADCA Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
	<register id="ADCB_AC" width="32" page="1" offset="0x2" internal="0" description="ADCB Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
	<register id="ADCC_AC" width="32" page="1" offset="0x4" internal="0" description="ADCC Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
	<register id="CMPSS1_AC" width="32" page="1" offset="0x10" internal="0" description="CMPSS1 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="CMPSS2_AC" width="32" page="1" offset="0x12" internal="0" description="CMPSS2 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="CMPSS3_AC" width="32" page="1" offset="0x14" internal="0" description="CMPSS3 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="CMPSS4_AC" width="32" page="1" offset="0x16" internal="0" description="CMPSS4 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="CMPSS5_AC" width="32" page="1" offset="0x18" internal="0" description="CMPSS5 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="CMPSS6_AC" width="32" page="1" offset="0x1a" internal="0" description="CMPSS6 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="CMPSS7_AC" width="32" page="1" offset="0x1c" internal="0" description="CMPSS7 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="CMPSS8_AC" width="32" page="1" offset="0x1e" internal="0" description="CMPSS8 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="CMPSS9_AC" width="32" page="1" offset="0x20" internal="0" description="CMPSS9 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="CMPSS10_AC" width="32" page="1" offset="0x22" internal="0" description="CMPSS10 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
