IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_cpu1_periph_ac_regs.xml
	<register id="CMPSS11_AC" width="32" page="1" offset="0x24" internal="0" description="CMPSS11 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="DACA_AC" width="32" page="1" offset="0x28" internal="0" description="DACA Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="DACC_AC" width="32" page="1" offset="0x2c" internal="0" description="DACC Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM1_AC" width="32" page="1" offset="0x48" internal="0" description="EPWM1 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM2_AC" width="32" page="1" offset="0x4a" internal="0" description="EPWM2 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM3_AC" width="32" page="1" offset="0x4c" internal="0" description="EPWM3 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM4_AC" width="32" page="1" offset="0x4e" internal="0" description="EPWM4 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM5_AC" width="32" page="1" offset="0x50" internal="0" description="EPWM5 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM6_AC" width="32" page="1" offset="0x52" internal="0" description="EPWM6 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM7_AC" width="32" page="1" offset="0x54" internal="0" description="EPWM7 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM8_AC" width="32" page="1" offset="0x56" internal="0" description="EPWM8 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM9_AC" width="32" page="1" offset="0x58" internal="0" description="EPWM9 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM10_AC" width="32" page="1" offset="0x5a" internal="0" description="EPWM10 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM11_AC" width="32" page="1" offset="0x5c" internal="0" description="EPWM11 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM12_AC" width="32" page="1" offset="0x5e" internal="0" description="EPWM12 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM13_AC" width="32" page="1" offset="0x60" internal="0" description="EPWM13 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM14_AC" width="32" page="1" offset="0x62" internal="0" description="EPWM14 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM15_AC" width="32" page="1" offset="0x64" internal="0" description="EPWM15 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM16_AC" width="32" page="1" offset="0x66" internal="0" description="EPWM16 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM17_AC" width="32" page="1" offset="0x68" internal="0" description="EPWM17 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM18_AC" width="32" page="1" offset="0x6a" internal="0" description="EPWM18 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="EQEP1_AC" width="32" page="1" offset="0x70" internal="0" description="EQEP1 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="EQEP2_AC" width="32" page="1" offset="0x72" internal="0" description="EQEP2 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="EQEP3_AC" width="32" page="1" offset="0x74" internal="0" description="EQEP3 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="EQEP4_AC" width="32" page="1" offset="0x76" internal="0" description="EQEP4 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="EQEP5_AC" width="32" page="1" offset="0x78" internal="0" description="EQEP5 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="EQEP6_AC" width="32" page="1" offset="0x7a" internal="0" description="EQEP6 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="ECAP1_AC" width="32" page="1" offset="0x80" internal="0" description="ECAP1 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="ECAP2_AC" width="32" page="1" offset="0x82" internal="0" description="ECAP2 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access c+D2593onditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
