IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_cpu1_periph_ac_regs.xml
	<register id="ECAP3_AC" width="32" page="1" offset="0x84" internal="0" description="ECAP3 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="ECAP4_AC" width="32" page="1" offset="0x86" internal="0" description="ECAP4 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="ECAP5_AC" width="32" page="1" offset="0x88" internal="0" description="ECAP5 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="ECAP6_AC" width="32" page="1" offset="0x8a" internal="0" description="ECAP6 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="ECAP7_AC" width="32" page="1" offset="0x8c" internal="0" description="ECAP7 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="SDFM1_AC" width="32" page="1" offset="0xa8" internal="0" description="SDFM1 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="SDFM2_AC" width="32" page="1" offset="0xaa" internal="0" description="SDFM2 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="SDFM3_AC" width="32" page="1" offset="0xac" internal="0" description="SDFM3 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="SDFM4_AC" width="32" page="1" offset="0xae" internal="0" description="SDFM4 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="CLB1_AC" width="32" page="1" offset="0xb0" internal="0" description="CLB1 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
	<register id="CLB2_AC" width="32" page="1" offset="0xb2" internal="0" description="CLB2 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
	<register id="CLB3_AC" width="32" page="1" offset="0xb4" internal="0" description="CLB3 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
	<register id="CLB4_AC" width="32" page="1" offset="0xb6" internal="0" description="CLB4 Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
